app/controllers/bus_stops_controller.rb

SELECT `bus_stops`.* FROM `bus_stops`
---
  def index
    @bus_stops = BusStop.all

INSERT INTO `bus_stops` (`name`, `street`, `district`, `state`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES ('Chandkheda', 'Ahmedabad-Kalol Highway', 'Ahmedabad', 'Gujarat', 4, 4, '2016-03-27 10:27:42', '2016-03-27 10:27:42')
---
  def create
    @bus_stop = BusStop.new(bus_stop_params)

    respond_to do |format|
      if @bus_stop.save

UPDATE `bus_stops` SET `district` = '', `state` = '', `updated_at` = '2016-03-27 12:00:02' WHERE `bus_stops`.`id` = 1
---
  def update
    respond_to do |format|
      if @bus_stop.update(bus_stop_params)

SELECT  `bus_stops`.* FROM `bus_stops` WHERE `bus_stops`.`id` = 1 LIMIT 1
---
    def set_bus_stop
      @bus_stop = BusStop.find(params[:id])